# Parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [
    [ -1, 1, Conv, [ 64, 6, 2, 2 ] ], # 0-P1/2
    [ -1, 1, Conv, [ 128, 3, 2 ] ], # 1-P2/4
    [ -1, 3, C3_ContextGuided, [ 128 ] ],
    [-1, 3, SimAM, [128]],
    [ -1, 1, Conv, [ 256, 3, 2 ] ], # 3-P3/8
    [ -1, 6, C3_ContextGuided, [ 256 ] ],
    [-1, 3, SimAM, [256]],
    [ -1, 1, Conv, [ 512, 3, 2 ] ], # 5-P4/16
    [ -1, 9, C3_ContextGuided, [ 512 ] ],
    [-1, 3, SimAM, [512]],
    [ -1, 1, Conv, [ 1024, 3, 2 ] ], # 7-P5/32
    [ -1, 3, C3_ContextGuided, [ 1024 ] ],
    [ -1, 1, SPPF, [ 1024, 5 ] ], # 9

  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, CrissCrossAttention, [1024]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3_ContextGuided, [512, False]],  # 7
   [-1, 1, CBAM, [512]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3_ContextGuided, [256, False]],  # 11 (P3/8-small)
   [-1, 1, CBAM, [256]],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3_ContextGuided, [512, False]],  # 14 (P4/16-medium)
   [-1, 1, CBAM, [512]],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3_ContextGuided, [1024, False]],  # 17 (P5/32-large)
   [-1, 1, CBAM, [1024]],

   [[23,27,31], 1, Segment, [nc, anchors, 32, 256]], # Detect(P3, P4, P5)
  ]