# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 26  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, DHMCS-FM, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, DHMCS-FM, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, DHMCS-FM, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, DHMCS-FM, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# DAMO-YOLO GFPN Head
head:
  [[-1, 1, Conv, [512,1,1]], # 10
   [6, 1, Conv, [512, 3, 2]],
   [-1, 1, FourierAttention_PFMLP, [512,16]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, DHMCS-FM, [512]], # 13


   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #14
   [4, 1, Conv, [256, 3, 2]], # 15
   [-1, 1, FourierAttention_PFMLP, [256,16]],
   [[15, -1, 6], 1, Concat, [1]],
   [-1, 3, DHMCS-FM, [512]], # 17

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, DHMCS-FM, [256]], # 20

   [-1, 1, Conv, [256, 3, 2]],
   [-1, 1, DHMCS-FM, [256]],
   [[-1, 19], 1, Concat, [1]],
   [-1, 3, DHMCS-FM, [512]], # 23

   [17, 1, Conv, [256, 3, 2]], # 24
   [26, 1, Conv, [256, 3, 2]], # 25
   [[14, 27, -1], 1, Concat, [1]],
   [-1, 3,DHMCS-FM, [1024]], # 27

   [[22, 26, 30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]